snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СкидкиКонтрагентов/СкидкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиКонтрагентов</name>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСкидокКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзменийУсловийРаботы</name>
    <type>
      <types>CatalogRef.ПричиныИзменийУсловийРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ЛистЗагрузки/ЛистЗагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистЗагрузки</name>
  <registerRecords>AccumulationRegister.ОстаткиЗХ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгружатьНеполныеНакладные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьИзменениеМаршурта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончательнойПечати</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерХодки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтгрузки</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНакладных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛистыНабора</name>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШККоробки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Паллета</name>
      <type>
        <types>DocumentRef.Паллета</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКПаллеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заявка</name>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Паллеты</name>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШКПаллеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаллеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратПаллет</name>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПНК</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/WebServices/DataService/Module.bsl
Функция GetData(DataType,DataName,Param)
	
	
	возврат "Пока что левый текст";
КонецФункции

Функция GetInfo(DataType, DataName, Param)
	
	если Param="ОбщаяЗагрузкаСправочников" тогда
		ТЗСправочников=новый ТаблицаЗначений;
		ТЗСправочников.Колонки.Добавить("ИмяСправочника");		
		СтрТЗ=ТЗСправочников.Добавить();
		СтрТЗ.ИмяСправочника="Номенклатура";
		СтрТЗ=ТЗСправочников.Добавить();
		СтрТЗ.ИмяСправочника="ШтрихКоды";
		СтруктураОбмена=РаботаСWS.ПолучитьСтруктуруСправочниковДляWS(ТЗСправочников);		
	ИначеЕсли Param="ЗагрузкаПланаНабора" тогда 
		СтруктураОбмена=РаботаСWS.ПолучитьСтруктуруПлановНабора();	
		// Кухарь А.Ю.  28.07.2022 начало
		//
	ИначеЕсли Param="СверкаТабеляИзЗУП" тогда 
		КодПодразделения="SSP-0211";
		Дата=Дата(DataName);
		СтруктураОбмена= РаботаСWS.ПолучитьДанныеТабеля(КодПодразделения,Дата);	
		// Кухарь А.Ю.  28.07.2022 конец
		// Кухарь А.Ю.  06.07.2023 начало
	ИначеЕсли Param="ПолучитьДанныеПапокНоменклатурыВерхнегоУровня" тогда
		СтруктураОбмена= РаботаСWS.ПолучитьДанныеПоПапкамВерхнегоУровня();	
		
	ИначеЕсли  Param="ПолучитьДанныеКаналовСбыта" тогда
		СтруктураОбмена= РаботаСWS.ПолучитьДанныеПоКаналамСбыта();	
		// Кухарь А.Ю.  06.07.2023 конец
	КонецЕсли;
	
	
	
	записьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(записьJSON,СтруктураОбмена);
	СтрJSON = ЗаписьJSON.Закрыть();	
	Возврат СтрJSON;
КонецФункции

Функция GetInvList(NumList)
	// Вставить содержимое обработчика.
	стрРезультат = ВернутьСтруктуруРезультатОбм(NumList);
	джЗапись = Новый ЗаписьJSON;
	джЗапись.УстановитьСтроку();
	ЗаписатьJSON(джЗапись, стрРезультат);
	Возврат джЗапись.Закрыть();
КонецФункции

Функция ВернутьСтруктуруРезультатОбм(jsonstr)
	стрРезультат = Новый Структура("RS, Error, ErrorDescription", "", "", "");
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(jsonstr);
		//ЧтениеJSON.ОткрытьФайл(ИмяФайла);
		Сода = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		//стрРезультат.ID=Формат(Выб.Ссылка.Номер,"ЧДЦ=; ЧГ=");
		стрРезультат.Error = "readingjson_error";
		стрРезультат.ErrorDescription = "Error during reading json string";
		Возврат стрРезультат;
	КонецПопытки;
	Попытка
		
		Запрос = Новый Запрос;
		НомерЛиста=СокрЛП(Сода["LNum"]);
		
		Если ЗначениеЗаполнено(НомерЛиста) Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			//ЛистЗагрузкиЗаявка.НомерНакладной КАК НомерНакладной,
			|ЛистЗагрузкиЛистыНабора.ДатаНакладной КАК ДатаНакладной,
			|ЛистЗагрузкиЛистыНабора.НомерНакладной КАК НомерНакладной,
			|ЛистЗагрузкиЗаявка.Ссылка.Номер КАК Номер,
			|ЛистЗагрузкиЗаявка.Ссылка.СостояниеНакладной КАК СостояниеНакладной
			|ИЗ
			|Документ.ЛистЗагрузки.Заявка КАК ЛистЗагрузкиЗаявка
			|СОЕДИНЕНИЕ Документ.ЛистЗагрузки.ЛистыНабора КАК ЛистЗагрузкиЛистыНабора
			|ПО ЛистЗагрузкиЗаявка.Ссылка = ЛистЗагрузкиЛистыНабора.Ссылка
			|И ЛистЗагрузкиЗаявка.Получатель = ЛистЗагрузкиЛистыНабора.Получатель
			|И ЛистЗагрузкиЗаявка.ПунктДоставки = ЛистЗагрузкиЛистыНабора.ПунктДоставки
			|И ЛистЗагрузкиЗаявка.НомерНакладной = ЛистЗагрузкиЛистыНабора.НомерНакладной
			|ГДЕ
			|ЛистЗагрузкиЗаявка.Ссылка.Номер=&НомерЛиста
			//ЛистЗагрузкиЗаявка.Получатель = &Получатель
			//И ЛистЗагрузкиЗаявка.ПунктДоставки = &ПунктДоставки
			//И ЛистЗагрузкиЗаявка.Ссылка.ДатаОтгрузки >= &ДатаОтгрузки
			
			|СГРУППИРОВАТЬ ПО
			//ЛистЗагрузкиЗаявка.НомерНакладной,
			|ЛистЗагрузкиЛистыНабора.ДатаНакладной,
			|ЛистЗагрузкиЗаявка.Ссылка.Номер,
			|ЛистЗагрузкиЛистыНабора.НомерНакладной,
			|ЛистЗагрузкиЗаявка.Ссылка.СостояниеНакладной
			|";
			Запрос.УстановитьПараметр("НомерЛиста", НомерЛиста);
		Иначе
			ДатаОт=ПолучитьДатуИзСтр(СокрЛП(Сода["SHDate"]));
			КодКонтра=СокрЛП(Сода["Rec"]);
			Запрос.Текст = "ВЫБРАТЬ
			//ЛистЗагрузкиЗаявка.НомерНакладной КАК НомерНакладной,
			|ЛистЗагрузкиЛистыНабора.ДатаНакладной КАК ДатаНакладной,
			|ЛистЗагрузкиЛистыНабора.НомерНакладной КАК НомерНакладной,
			|ЛистЗагрузкиЗаявка.Ссылка.Номер КАК Номер,
			|ЛистЗагрузкиЗаявка.Ссылка.СостояниеНакладной КАК СостояниеНакладной
			|ИЗ
			|Документ.ЛистЗагрузки.Заявка КАК ЛистЗагрузкиЗаявка
			|СОЕДИНЕНИЕ Документ.ЛистЗагрузки.ЛистыНабора КАК ЛистЗагрузкиЛистыНабора
			|ПО ЛистЗагрузкиЗаявка.Ссылка = ЛистЗагрузкиЛистыНабора.Ссылка
			|И ЛистЗагрузкиЗаявка.Получатель = ЛистЗагрузкиЛистыНабора.Получатель
			|И ЛистЗагрузкиЗаявка.ПунктДоставки = ЛистЗагрузкиЛистыНабора.ПунктДоставки
			|И ЛистЗагрузкиЗаявка.НомерНакладной = ЛистЗагрузкиЛистыНабора.НомерНакладной
			|ГДЕ
			//|ЛистЗагрузкиЗаявка.Ссылка.Номер=&НомерЛиста
			|ЛистЗагрузкиЗаявка.Получатель = &Получатель
			//И ЛистЗагрузкиЗаявка.ПунктДоставки = &ПунктДоставки
			|И ЛистЗагрузкиЗаявка.Ссылка.ДатаОтгрузки >= &ДатаОтгрузки1
			|И ЛистЗагрузкиЗаявка.Ссылка.ДатаОтгрузки <= &ДатаОтгрузки2
			|СГРУППИРОВАТЬ ПО
			//ЛистЗагрузкиЗаявка.НомерНакладной,
			|ЛистЗагрузкиЛистыНабора.ДатаНакладной,
			|ЛистЗагрузкиЗаявка.Ссылка.Номер,
			|ЛистЗагрузкиЛистыНабора.НомерНакладной,
			|ЛистЗагрузкиЗаявка.Ссылка.СостояниеНакладной
			|";
			Запрос.УстановитьПараметр("Получатель", Справочники.Контрагенты.НайтиПоКоду(КодКонтра));
			Запрос.УстановитьПараметр("ДатаОтгрузки1", НачалоДня(ДатаОт));
			Запрос.УстановитьПараметр("ДатаОтгрузки2", КонецДня(ДатаОт));
		КонецЕсли;
		МасЭл = Новый Массив;
		
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			МасЭл.Добавить(Новый Структура("InvNum", СокрЛП(Выб.НомерНакладной)));
		КонецЦикла;
		стрРезультат.RS = МасЭл;
	Исключение
		//стрРезультат.ID=Формат(Выб.Ссылка.Номер,"ЧДЦ=; ЧГ=");
		стрРезультат.Error = "procdata_error";
		стрРезультат.ErrorDescription = "Error during data processsing: " + ОписаниеОшибки();
		Возврат стрРезультат;
	КонецПопытки;
	
	Возврат стрРезультат;
КонецФункции

Функция ПолучитьДатуИзСтр(СтрДата) Экспорт
	Рез=неопределено;
	
	Попытка
		СтрДата=СокрЛП(СтрДата);
		СтрРез="";
		РаздТ=Найти(СтрДата,".");
		РаздТр=Найти(СтрДата,"-");
		РаздЗ=Найти(СтрДата,",");
		РаздСП=Найти(СтрДата,"/");
		РаздСО=Найти(СтрДата,"\");
		РаздДТ=Найти(СтрДата,":");
		Если (РаздТ>0) И (РаздТр>0) Тогда
			Если (РаздТ>РаздТр) Тогда
				РаздТ=0;
			КонецЕсли;	
		КонецЕсли;	
		
		Если РаздТ>0 ИЛИ РаздЗ>0  ИЛИ РаздСП>0 ИЛИ РаздСО>0 Тогда
			//Если РаздСО>0 Тогда
			//ИначеЕсли РаздСП>0 Тогда
			//ИначеЕсли РаздСЗ>0 Тогда
			//Иначе
			//предположим германский с разными разделителями
			Если Сред(СтрДата,3,1)="." Тогда
				Попытка
					Если РаздДТ>0 Тогда
						СтрРез=Сред(СтрДата,7,4)+Сред(СтрДата,4,2)+Лев(СтрДата,2);
						СтрЧМ=СокрЛП(Сред(СтрДата,11));
						СтрЧМ=СтрЗаменить(СтрЧМ,":","");
						СтрЧМ=СтрЗаменить(СтрЧМ,"T","");
						Если СтрДлина(СтрЧМ)=5 Тогда
							СтрЧМ="0"+СтрЧМ;
						КонецЕсли;	
						Если СтрДлина(СтрЧМ)>6 Тогда
							СтрЧМ=Лев(СтрЧМ,6);
						КонецЕсли;
						Если НЕ(СтрЧМ="000000") Тогда
							СтрРез=СтрРез+СтрЧМ;
						КонецЕсли;
						Рез=Дата(СтрРез);
					Иначе	
						СтрРез=Сред(СтрДата,7,4)+Сред(СтрДата,4,2)+Лев(СтрДата,2);
						Рез=Дата(СтрРез);
					КонецЕсли;	
				Исключение
				КонецПопытки;	
			КонецЕсли;	
			//КонецЕсли;	
		ИначеЕсли РаздТр>0 Тогда
			
			Если Сред(СтрДата,3,1)="-" Тогда
				Попытка
					Если РаздДТ>0 Тогда
						СтрРез=Сред(СтрДата,7,4)+Сред(СтрДата,4,2)+Лев(СтрДата,2);
						СтрЧМ=СокрЛП(Сред(СтрДата,11));
						
						СтрЧМ=СтрЗаменить(СтрЧМ,":","");
						СтрЧМ=СтрЗаменить(СтрЧМ,"T","");
						Если СтрДлина(СтрЧМ)=5 Тогда
							СтрЧМ="0"+СтрЧМ;
						КонецЕсли;
						Если СтрДлина(СтрЧМ)>6 Тогда
							СтрЧМ=Лев(СтрЧМ,6);
						КонецЕсли;
						Если НЕ(СтрЧМ="000000") Тогда
							СтрРез=СтрРез+СтрЧМ;
						КонецЕсли;
						Рез=Дата(СтрРез);
					Иначе	
						СтрРез=Сред(СтрДата,7,4)+Сред(СтрДата,4,2)+Лев(СтрДата,2);
						Рез=Дата(СтрРез);
					КонецЕсли;	
				Исключение
				КонецПопытки;	
			Иначе
				
				СтрЧМ=СокрЛП(Сред(СтрДата,11));
				СтрРез=СтрЗаменить(СокрЛП(Лев(СтрДата,10)),"-","");
				СтрЧМ=СтрЗаменить(СтрЧМ,":","");
				СтрЧМ=СтрЗаменить(СтрЧМ,"T","");
				Если СтрДлина(СтрЧМ)=5 Тогда
					СтрЧМ="0"+СтрЧМ;
				КонецЕсли;	
				Если СтрДлина(СтрЧМ)>6 Тогда
					СтрЧМ=Лев(СтрЧМ,6);
				КонецЕсли;
				Если НЕ(СтрЧМ="000000") Тогда
					СтрРез=СтрРез+СтрЧМ;
				КонецЕсли;
				Рез=Дата(СтрРез);
			КонецЕсли;
			
			
			
		Иначе
			//анси формат
			Если СтрДлина(СтрДата)>=8 Тогда
				Рез=Дата(Лев(СтрДата,8));
			КонецЕсли;	
		КонецЕсли;	
	Исключение
	КонецПопытки;
	Возврат Рез;
КонецФункции

Функция GetColList(ItemsList)
	стрРезультат = ВернутьСтруктуруРезультатОбм1(ItemsList);
	джЗапись = Новый ЗаписьJSON;
	джЗапись.УстановитьСтроку();
	ЗаписатьJSON(джЗапись, стрРезультат);
	Возврат джЗапись.Закрыть();
	
КонецФункции

Функция ВернутьСтруктуруРезультатОбм1(jsonstr)
	стрРезультат = Новый Структура("RS, Error, ErrorDescription", "", "", "");
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(jsonstr);
		//ЧтениеJSON.ОткрытьФайл(ИмяФайла);
		Сода = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		//стрРезультат.ID=Формат(Выб.Ссылка.Номер,"ЧДЦ=; ЧГ=");
		стрРезультат.Error = "readingjson_error";
		стрРезультат.ErrorDescription = "Error during reading json string";
		ЗаписатьВЛог("ВебСервис","Error during reading json string: " + ОписаниеОшибки(),"Информация");
		Возврат стрРезультат;
	КонецПопытки;
	Попытка
		МасКод=Новый Массив;
		МасК=Сода["CodeItems"];
		Для Каждого ТЭ Из МасК Цикл
			МасКод.Добавить(ТЭ);
		КонецЦикла;
		ДУ=?(МасКод.Количество()," И Номенклатура.Родитель.Код В (&МасКод) ","");
		Запрос = Новый Запрос;
		
		// ЗапросV8 = V8.NewObject("Запрос");
		//++Данилова Е.В. 15.10.2025 HELP-6674
		//Запрос.Текст=
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|Номенклатура.Родитель.Код КАК РодКод,
		//|Номенклатура.Цвет КАК Цвет
		//|ИЗ
		//|Справочник.Номенклатура КАК Номенклатура
		//|ГДЕ
		//|НЕ Номенклатура.ЭтоГруппа
		//|"+ДУ+"
		////|И Номенклатура.Родитель.Код В (&МасКод)
		//|упорядочить по 1
		//|";
		// 	
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Цвет КАК Цвет,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.СнятСПроизводства КАК СнятСПроизводства
		|ПОМЕСТИТЬ ВтТаблицаРазмеров
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.СнятСПроизводства
		|	"+ДУ+"
		|	И НЕ Номенклатура.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Родитель.Код КАК РодКод,
		|	Номенклатура.Цвет КАК Цвет,
		|	ЕСТЬNULL(ВтТаблицаРазмеров.СнятСПроизводства, ИСТИНА) КАК СнятСПроизводства
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРазмеров КАК ВтТаблицаРазмеров
		|		ПО Номенклатура.Родитель = ВтТаблицаРазмеров.Родитель
		|			И Номенклатура.Цвет = ВтТаблицаРазмеров.Цвет
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	"+ДУ+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	РодКод"; 	
		
		//--Данилова Е.В. 15.10.2025
		
		Если МасКод.Количество() Тогда
			Запрос.УстановитьПараметр("МасКод", МасКод);
		КонецЕсли;
		Выб=Запрос.Выполнить().Выбрать();
		МасЭл = Новый Массив;
		Пока Выб.Следующий() Цикл
			//++Данилова Е.В. 15.10.2025 HELP-6674
			//МасЭл.Добавить(Новый Структура("CodeItem,Color", СокрЛП(Выб.РодКод),СокрЛП(Выб.Цвет)));
			МасЭл.Добавить(Новый Структура("CodeItem,Color,removed", СокрЛП(Выб.РодКод),СокрЛП(Выб.Цвет),XMLСтрока(Выб.СнятСПроизводства)));
			//--Данилова Е.В. 15.10.2025
		КонецЦикла;	
		ЗаписатьВЛог("ВебСервис","ВР "+Строка(МасЭл.Количество()),"Информация");
		стрРезультат.RS = МасЭл;
		
	Исключение
		//стрРезультат.ID=Формат(Выб.Ссылка.Номер,"ЧДЦ=; ЧГ=");
		стрРезультат.Error = "procdata_error";
		стрРезультат.ErrorDescription = "Error during data processsing: " + ОписаниеОшибки();
		ЗаписатьВЛог("ВебСервис","Error during data processsing: " + ОписаниеОшибки(),"Информация");
		Возврат стрРезультат;
	КонецПопытки;
	
	Возврат стрРезультат;
КонецФункции

Функция ВернутьСтруктуруРезультатОбм2(jsonstr)
	стрРезультат = Новый Структура("RS, Error, ErrorDescription", "", "", "");
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(jsonstr);
		//ЧтениеJSON.ОткрытьФайл(ИмяФайла);
		Сода = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		//стрРезультат.ID=Формат(Выб.Ссылка.Номер,"ЧДЦ=; ЧГ=");
		стрРезультат.Error = "readingjson_error";
		стрРезультат.ErrorDescription = "Error during reading json string";
		Возврат стрРезультат;
	КонецПопытки;
	Попытка
		
		Запрос = Новый Запрос;
		НомерЛиста=СокрЛП(Сода["LNum"]);
		
		Если ЗначениеЗаполнено(НомерЛиста) Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛистЗагрузки.ДатаОтгрузки КАК ДатаОтгрузки,
			|	ЛистЗагрузки.Водитель.Наименование КАК Водит,
			|	ЛистЗагрузки.Автомобиль.Наименование КАК Автом
			|ИЗ
			|	Документ.ЛистЗагрузки КАК ЛистЗагрузки
			|ГДЕ
			|	ЛистЗагрузки.Номер = &НомерЛиста";
			Запрос.УстановитьПараметр("НомерЛиста", НомерЛиста);
		Иначе
			стрРезультат.Error = "Num_is_not_filled_error";
			стрРезультат.ErrorDescription = "Inv Num is empty";
			Возврат стрРезультат;
			
		КонецЕсли;
		ВС = Новый Структура;
		ДатаОт="";
		Автом="";
		Водит="";
		Выб = Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			ДатаОт=Формат(Выб.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
			Автом=СокрЛП(Выб.Автом);
			Водит=СокрЛП(Выб.Водит);
		КонецЕсли;
		ВС.Вставить("ShipD",ДатаОт);
		ВС.Вставить("Avtom",Автом);
		ВС.Вставить("Driver",Водит);
		стрРезультат.RS = ВС;
	Исключение
		//стрРезультат.ID=Формат(Выб.Ссылка.Номер,"ЧДЦ=; ЧГ=");
		стрРезультат.Error = "procdata_error";
		стрРезультат.ErrorDescription = "Error during data processsing: " + ОписаниеОшибки();
		Возврат стрРезультат;
	КонецПопытки;
	
	Возврат стрРезультат;
КонецФункции

Функция GetInvDat(NumList)
	// Вставить содержимое обработчика.
	стрРезультат2 = ВернутьСтруктуруРезультатОбм2(NumList);
	джЗапись = Новый ЗаписьJSON;
	джЗапись.УстановитьСтроку();
	ЗаписатьJSON(джЗапись, стрРезультат2);
	Возврат джЗапись.Закрыть();
КонецФункции


Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();  
	Возврат ТЗ;
КонецФункции
//Кухарь А.Ю  27.01.2025 начало
// Определено уже в модуле общего назначения
//Функция Сериализовать(ОбъектСериализации)        
//	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
//	МойXML = Новый ЗаписьXML;
//	МойXML.УстановитьСтроку();
//	ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
//	Возврат МойXML.Закрыть();
//КонецФункции
//Кухарь А.Ю  27.01.2025 конец


Функция getMatrix(structure)
	СтруктураПараметров = Десериализовать(structure);
	КодКонтрагентаSNL = СтруктураПараметров.КодКонтрагентаSNL;
	ТаблицаШК = СтруктураПараметров.ТаблицаШК;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	вт КАК вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатрицаТовары.Номенклатура.Код КАК КодЭлемента,
	|	МатрицаТовары.Номенклатура.Наименование КАК НаименованиеЭлемента,
	|	МатрицаТовары.ШККонтрагента КАК ШтрихКод,
	|	МатрицаТовары.Номенклатура.Родитель.Наименование КАК НаименованиеМодели,
	|	МатрицаТовары.Номенклатура.Родитель.Код КАК КодМодели,
	|	МатрицаТовары.Номенклатура.Родитель.Родитель.Родитель.Код КАК КодБрэнда
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	(МатрицаТовары.Ссылка.Проведен
	|				И МатрицаТовары.Ссылка.Контрагент.Код = &Контрагент
	|			ИЛИ МатрицаТовары.Ссылка.Контрагент.Ведущий.Код = &Контрагент
	|				И МатрицаТовары.Ссылка.Дата <= &Дата
	|				И МатрицаТовары.Ссылка.ДатаОкончания >= &ДатаОкончания
	|				И МатрицаТовары.ШККонтрагента В
	|					(ВЫБРАТЬ
	|						ИсходныеДанные.Штрихкод
	|					ИЗ
	|						ИсходныеДанные КАК ИсходныеДанные))";
	Запрос.УстановитьПараметр("ТЗ",ТаблицаШК);
	Запрос.УстановитьПараметр("Контрагент",КодКонтрагентаSNL);
	Запрос.УстановитьПараметр("Дата",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания",НачалоДня(ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат Сериализовать(РезультатЗапроса);
КонецФункции


Функция getRequest(List)
	тз = Десериализовать(List);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	вт КАК вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихКоды.Наименование КАК ШтрихКод,
	|	ШтрихКоды.Владелец.Наименование КАК НаименованиеЭлемента,
	|	ШтрихКоды.Владелец.Код КАК КодЭлемента,
	|	ШтрихКоды.Владелец.Родитель.Наименование КАК НаименованиеМодели,
	|	ШтрихКоды.Владелец.Родитель.Код КАК КодМодели,
	|	ШтрихКоды.Владелец.Родитель.Родитель.Родитель.Код КАК КодБрэнда
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	|		ПО (ШтрихКоды.Ссылка В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ШтрихКоды.Ссылка
	|				ИЗ
	|					Справочник.ШтрихКоды КАК ШтрихКоды
	|				ГДЕ
	|					ИсходныеДанные.Штрихкод = ШтрихКоды.Наименование
	|					И НЕ ШтрихКоды.ПометкаУдаления))";
	Запрос.УстановитьПараметр("ТЗ",тз);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат Сериализовать(РезультатЗапроса);
КонецФункции


Функция getBarcode(List)
	тз = Десериализовать(List);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Код81 КАК Код81
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Код81 КАК Код81
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	вт КАК вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихКоды.Владелец.Код КАК Код81,
	|	ШтрихКоды.Наименование КАК ШК
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	|		ПО (ШтрихКоды.Владелец.Код = ИсходныеДанные.Код81)
	|			И (НЕ ПОДСТРОКА(ШтрихКоды.Наименование, 1, 5) = ""99999"")
	|			И (НЕ ШтрихКоды.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код81,
	|	ШК
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ТЗ",тз);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат Сериализовать(РезультатЗапроса);
КонецФункции


Функция getNomenklaturaSNL(Spisok)
	СписокКодовSNL = Десериализовать(Spisok);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Код В(&СписокКодовSNL)
	|	И Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("СписокКодовSNL", СписокКодовSNL);
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Родитель.Код КАК КодРодителя,
	|	Номенклатура.Размер.Наименование КАК Размер,
	|	Номенклатура.Цвет.Наименование КАК Цвет
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель.Код В(&СписокКодовSNL)
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("СписокКодовSNL", СписокКодовSNL);
	
	ТЗЦветовИРазмеров = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихКоды.Наименование КАК ШК,
	|	ШтрихКоды.Владелец.Наименование КАК НаименованиеЭлемента,	
	|	ШтрихКоды.Владелец.Код КАК Код
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец.Родитель.Код В(&СписокКодовSNL)";
	
	Запрос.УстановитьПараметр("СписокКодовSNL", СписокКодовSNL);
	
	ТЗШтрихКодов = Запрос.Выполнить().Выгрузить();
	СтруктураОтвета = Новый Структура("Тз, ТЗЦветовИРазмеров, ТЗШтрихКодов",Тз, ТЗЦветовИРазмеров, ТЗШтрихКодов);
	Возврат Сериализовать(СтруктураОтвета);
	
КонецФункции


Функция getPriceSNL(Spisok)
	СтруктураЗапроса = Десериализовать(Spisok);
	Дата2 = СтруктураЗапроса.Дата2;
	ТипЦен = СтруктураЗапроса.ТипЦен;
	СписокКодовНоменклатуры = СтруктураЗапроса.СписокКодовНоменклатуры;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код КАК КодНоменклатуры,
		|	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК Период
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
		|			ТипЦен.Код = &ТипЦен
		|				И Прайс.Проведен
		|				И КОНЕЦПЕРИОДА(Прайс.Дата2, ДЕНЬ) >= &Дата2
		|				И Прайс.Дата <= &Дата2
		|				И Номенклатура.Код В (&СписокКодовНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|			МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Прайс.Дата) КАК Дата
		|		ИЗ
		|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|					КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
		|					ТипЦен.Код = &ТипЦен
		|						И Прайс.Проведен
		|						И КОНЕЦПЕРИОДА(Прайс.Дата2, ДЕНЬ) >= &Дата2
		|						И Прайс.Дата <= &Дата2
		|						И Номенклатура.Код В (&СписокКодовНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ГДЕ
		|			ЦеныНоменклатурыСрезПоследних.Номенклатура.ЭтоГруппа
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК Даты
		|		ПО ЦеныНоменклатурыСрезПоследних.Прайс.Дата = Даты.Дата
		|			И ЦеныНоменклатурыСрезПоследних.Номенклатура = Даты.Номенклатура
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("СписокКодовНоменклатуры", СписокКодовНоменклатуры);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(РезультатЗапроса), Новый СжатиеДанных(9)));
	Возврат Ответ;
КонецФункции

Функция getColor(List)
	тз = Десериализовать(List);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Код81 КАК Код81
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Код81 КАК Код81
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	вт КАК вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Код КАК Код81,
	|	Номенклатура.Родитель.Код как Код81Модели,	
	|	Номенклатура.Родитель.Наименование как НаименованиеМодели,	
	|	Номенклатура.Цвет.Наименование КАК Цвет,
	|	Номенклатура.Наименование КАК Наименование,	
	|	Номенклатура.Размер.Наименование КАК Размер
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ИсходныеДанные.Код81 = Номенклатура.Родитель.Код
	|			И (НЕ Номенклатура.ЭтоГруппа)
	|			И (НЕ Номенклатура.ПометкаУдаления)";
	Запрос.УстановитьПараметр("ТЗ",тз);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат Сериализовать(РезультатЗапроса);
КонецФункции

Функция getPerson()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Наименование КАК Наименование,
		|	ФизическиеЛица.Код КАК Код81,
		|	ФизическиеЛица.ЭтоГруппа КАК ЭтоГруппа,
		|	ЕСТЬNULL(ФизическиеЛица.Штатный, """") КАК Штатный,
		|	ЕСТЬNULL(ФизическиеЛица.НеИспользовать, """") КАК НеИспользовать,
		|	ЕСТЬNULL(ФизическиеЛица.ШтрихКод, """") КАК ШтрихКод,
		|	ФизическиеЛица.ЕМэйл КАК ЕМэйл,
		|	ЕСТЬNULL(ФизическиеЛица.Должность.Наименование, """") КАК Должность,
		|	ЕСТЬNULL(ФизическиеЛица.Родитель.Код, """") КАК Код81_Папа
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	НЕ ФизическиеЛица.ПометкаУдаления
		|	И (ФизическиеЛица.Код = &Код
		|			ИЛИ ФизическиеЛица.Родитель.Код = &Код
		|			ИЛИ ФизическиеЛица.Родитель.Родитель.Код = &Код
		|			ИЛИ ФизическиеЛица.Родитель.Родитель.Родитель.Код = &Код
		|			ИЛИ ФизическиеЛица.Родитель.Родитель.Родитель.Родитель.Код = &Код)
		|	И НЕ(ЕСТЬNULL(ФизическиеЛица.Код, """") В (&СписокКодов)
		|				ИЛИ ЕСТЬNULL(ФизическиеЛица.Родитель.Код, """") В (&СписокКодов)
		|				ИЛИ ЕСТЬNULL(ФизическиеЛица.Родитель.Родитель.Код, """") В (&СписокКодов)
		|				ИЛИ ЕСТЬNULL(ФизическиеЛица.Родитель.Родитель.Родитель.Код, """") В (&СписокКодов)
		|				ИЛИ ЕСТЬNULL(ФизическиеЛица.Родитель.Родитель.Родитель.Родитель.Код, """") В (&СписокКодов))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическиеЛица.Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Код", "SNL-00849");
	СписокНенужныхКодов = Новый СписокЗначений;
	СписокНенужныхКодов.добавить("SNL-00850");  //ДЛ
	СписокНенужныхКодов.добавить("SNL-01028");  //Безопасники
	СписокНенужныхКодов.добавить("SNL-00782");  //Дизайн Бюро
	СписокНенужныхКодов.добавить("SNL-00853");  //кадры
	СписокНенужныхКодов.добавить("SNL-00858");  //Розница
	СписокНенужныхКодов.добавить("SNL-01446");  //Фин отдел
	Запрос.УстановитьПараметр("СписокКодов", СписокНенужныхКодов);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат Сериализовать(РезультатЗапроса);

КонецФункции

Функция getManager(List)
	тз = Десериализовать(List);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.КодSNL КАК КодSNL
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.КодSNL КАК КодSNL
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	вт КАК вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Код КАК КодSNL,
	|	Контрагенты.Наименование КАК НаименованиеКонтрагента,
	|	Контрагенты.Менеджер.Код КАК КодМенеджера,
	|	Контрагенты.Менеджер.Наименование КАК НаименованиеМенеджера,
	|	Контрагенты.Менеджер.Родитель.Код КАК КодМенеджерРодитель,
	|	Контрагенты.Менеджер.Штатный КАК Штатный,
	|	ЕСТЬNULL(Контрагенты.Менеджер.Должность.Наименование, """") КАК Должность,
	|	Контрагенты.Менеджер.ШтрихКод КАК ШтрихКод,
	|	Контрагенты.Менеджер.ЕМэйл КАК Емэйл
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Код В
	|			(ВЫБРАТЬ
	|				ИсходныеДанные.КодSNL
	|			ИЗ
	|				ИсходныеДанные КАК ИсходныеДанные)";
	Запрос.УстановитьПараметр("ТЗ",тз);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат Сериализовать(РезультатЗапроса);
КонецФункции

// Ихсанов Д. А. Начало 10.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ID-18734
Функция GetCIS(НомерДокумента, ДатаДокумента, ТипДокумента)
	
	ДанныеОтвета = Неопределено;
	Если ТипДокумента = "РасходнаяНакладная" Тогда
		ДанныеОтвета = ПолучитьДанныеПоКИЗ_РасходнаяНакладная(НомерДокумента, ДатаДокумента);
	КонецЕсли;
	
	Если ДанныеОтвета <> Неопределено Тогда 
		СтрокаJSON = ОбменМаркетПлейс.СформироватьСтрокуJSON(ДанныеОтвета);
		
		Возврат СтрокаJSON;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Получить данные по КИЗ расходная накладная
//
// Параметры:
//  НомерДокумента	 - Строка	 - Номер документа РНК в системе склада
//  ДатаДокумента	 - Дата 	 - Дата документа РНК в системе склада
// 
// Возвращаемое значение:
//  Структура - Данные с кодами маркировки
//
Функция ПолучитьДанныеПоКИЗ_РасходнаяНакладная(НомерДокумента, ДатаДокумента)
	
	ДанныеПоКИЗ = Новый Структура;
	ДанныеПоКИЗ.Вставить("Дата",  Формат(ДатаДокумента, "ДФ=dd.MM.yyyy"));
	ДанныеПоКИЗ.Вставить("Номер", НомерДокумента);
	ДанныеПоКИЗ.Вставить("КИЗы",  Новый Массив);
	
	РасходнаяНакладная = Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокумента, ДатаДокумента);
	
	Запрос = Новый Запрос(ТекстЗапросаДанныеПоКодамМаркировки());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Ссылка", 	 РасходнаяНакладная);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураТовара = Новый Структура;
		СтруктураТовара.Вставить("DataMatrix");	СтруктураТовара.Вставить("СтоимостьБезНДС");
		СтруктураТовара.Вставить("SKU");        СтруктураТовара.Вставить("Количество");
		СтруктураТовара.Вставить("EAN");
		
		ЗаполнитьЗначенияСвойств(СтруктураТовара, Выборка);
		
		ДанныеПоКИЗ.КИЗы.Добавить(СтруктураТовара);
	КонецЦикла;
	
	Возврат ДанныеПоКИЗ;
	
КонецФункции // ПолучитьДанныеПоКИЗ_РасходнаяНакладная()

// Функция - Текст запроса данные по кодам маркировки
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаДанныеПоКодамМаркировки()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходнаяНакладная.Ссылка КАК Ссылка,
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяТовары.Цена КАК Цена,
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.Договор КАК Договор
	|ПОМЕСТИТЬ вт_ТоварыПоРасходнойНакладной
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	|		ПО РасходнаяНакладнаяТовары.Номенклатура = РасходнаяНакладнаяКомплектующие.Продукция
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|			ТОГДА ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки
	|		ИНАЧЕ ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора
	|	КОНЕЦ КАК ШтрихКод
	|ПОМЕСТИТЬ вт_КодыМаркировки
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
	|		ПО ХранилищеКодовМаркировки.Ссылка = ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка
	|ГДЕ
	|	ХранилищеКодовМаркировки.ДокОснование В
	|			(ВЫБРАТЬ
	|				вт_ТоварыПоРасходнойНакладной.Ссылка
	|			ИЗ
	|				вт_ТоварыПоРасходнойНакладной)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Представление КАК ЗначениеШтрихкода,
	|	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура
	|ПОМЕСТИТЬ вт_ПоштучныеКодыПоТоварам
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка В
	|			(ВЫБРАТЬ
	|				вт_КодыМаркировки.ШтрихКод
	|			ИЗ
	|				вт_КодыМаркировки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(128)) КАК АртикулКонтрагента,
	|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный
	|ПОМЕСТИТЬ вт_ДанныеМатрицы
	|ИЗ
	|	Документ.Матрица КАК Матрица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
	|		ПО Матрица.Ссылка = МатрицаТовары.Ссылка
	|ГДЕ
	|	Матрица.Контрагент В
	|			(ВЫБРАТЬ
	|				вт_ТоварыПоРасходнойНакладной.Контрагент
	|			ИЗ
	|				вт_ТоварыПоРасходнойНакладной)
	|	И МатрицаТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				вт_ТоварыПоРасходнойНакладной.Номенклатура
	|			ИЗ
	|				вт_ТоварыПоРасходнойНакладной)
	|	И Матрица.Проведен
	|	И Матрица.Проведен
	|	И Матрица.ДатаОкончания > &ТекущаяДата
	|	И Матрица.Договор В
	|			(ВЫБРАТЬ
	|				вт_ТоварыПоРасходнойНакладной.Договор
	|			ИЗ
	|				вт_ТоварыПоРасходнойНакладной)
	|	И МатрицаТовары.ШККонтрагента <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_ПоштучныеКодыПоТоварам.ЗначениеШтрихкода КАК DataMatrix,
	|	ЕСТЬNULL(вт_ДанныеМатрицы.АртикулКонтрагента, """") КАК SKU,
	|	1 КАК Количество,
	|	вт_ТоварыПоРасходнойНакладной.Цена КАК СтоимостьБезНДС,
	|	вт_ДанныеМатрицы.ШККонтрагентаДополнительный КАК EAN
	|ИЗ
	|	вт_ПоштучныеКодыПоТоварам КАК вт_ПоштучныеКодыПоТоварам
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ДанныеМатрицы КАК вт_ДанныеМатрицы
	|		ПО вт_ПоштучныеКодыПоТоварам.Номенклатура = вт_ДанныеМатрицы.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоварыПоРасходнойНакладной КАК вт_ТоварыПоРасходнойНакладной
	|		ПО вт_ПоштучныеКодыПоТоварам.Номенклатура = вт_ТоварыПоРасходнойНакладной.Номенклатура"
	
КонецФункции  // ТекстЗапросаДанныеПоКодамМаркировки()
// Ихсанов Д. А. Конец  10.04.2025

// +++ {Кузнецов Сергей Владимирович [07.11.2023]
Функция getCounterparty()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	//++Данилова Е.В. 16.04.2025 HELP-4327
		//"ВЫБРАТЬ
		//|	КонтрагентыИзменения.Ссылка КАК Ссылка,
		//|	КонтрагентыИзменения.Ссылка.ЕМэйл1 КАК ЕМэйл1,
		//|	КонтрагентыИзменения.Ссылка.КодВторичногоКонтрагентаДляB2B КАК КодВторичногоКонтрагентаДляB2B,
		//|	КонтрагентыИзменения.Ссылка.Наименование КАК Наименование,
		//|	КонтрагентыИзменения.Ссылка.КаналСбыта1 КАК КаналСбыта
		//|ИЗ
		//|	Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
		//|ГДЕ
		//|	КонтрагентыИзменения.Узел = &Узел
		//|	И НЕ КонтрагентыИзменения.Ссылка.ЭтоГруппа"; 
	
		"ВЫБРАТЬ
		|	КонтрагентыИзменения.Ссылка КАК Ссылка,
		|	КонтрагентыИзменения.Ссылка.ЕМэйл1 КАК ЕМэйл1,
		|	КонтрагентыИзменения.Ссылка.КодВторичногоКонтрагентаДляB2B КАК КодВторичногоКонтрагентаДляB2B,
		|	КонтрагентыИзменения.Ссылка.Наименование КАК Наименование,
		|	КонтрагентыИзменения.Ссылка.КаналСбыта1 КАК КаналСбыта
		|ПОМЕСТИТЬ ВТКонтрагенты
		|ИЗ
		|	Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
		|ГДЕ
		|	КонтрагентыИзменения.Узел = &Узел
		|	И НЕ КонтрагентыИзменения.Ссылка.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКонтрагенты.Ссылка КАК Ссылка,
		|	ВТКонтрагенты.ЕМэйл1 КАК ЕМэйл1,
		|	ВТКонтрагенты.КодВторичногоКонтрагентаДляB2B КАК КодВторичногоКонтрагентаДляB2B,
		|	ВТКонтрагенты.Наименование КАК Наименование,
		|	ВТКонтрагенты.КаналСбыта КАК КаналСбыта
		|ИЗ
		|	ВТКонтрагенты КАК ВТКонтрагенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СкидкиКонтрагентов.Номенклатура КАК Номенклатура,
		|	СкидкиКонтрагентов.Скидка КАК Скидка,
		|	ВТКонтрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	ВТКонтрагенты КАК ВТКонтрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
		|		ПО ВТКонтрагенты.Ссылка.Ведущий = СкидкиКонтрагентов.Контрагент";
	
	//--Данилова Е.В. 16.04.2025
	
	Запрос.УстановитьПараметр("Узел", ПланыОбмена.ОбменМерч.НайтиПоНаименованию("Мерч",Истина));
	//++Данилова Е.В. 16.04.2025
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет(); 
	ВыборкаДетальныеЗаписи = ПакетРезультатовЗапроса[1].Выбрать(); 
	ВыборкаСкидки = ПакетРезультатовЗапроса[2].Выбрать();
	//--Данилова Е.В. 16.04.2025
	МассивИзмененных = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураКонтрагента = Новый Структура("КодВторичногоКонтрагентаДляB2B, Наименование,ЕМэйл1,КаналСбытаКод,КаналСбытаНаименование,КаналСбытаУИД",
		ВыборкаДетальныеЗаписи.КодВторичногоКонтрагентаДляB2B,
		ВыборкаДетальныеЗаписи.Наименование,
		ВыборкаДетальныеЗаписи.ЕМэйл1,
		ВыборкаДетальныеЗаписи.КаналСбыта.Код,
		ВыборкаДетальныеЗаписи.КаналСбыта.Наименование,
		ВыборкаДетальныеЗаписи.КаналСбыта.УникальныйИдентификатор());
		МассивСкидок = Новый Массив;
		//Данилова Е.В. 16.04.2025 HELP-4327
		ОтборПоКонтрагенту = Новый Структура("Контрагент",ВыборкаДетальныеЗаписи.ссылка);
		Пока ВыборкаСкидки.НайтиСледующий(ОтборПоКонтрагенту) Цикл 
			//Для каждого Строка Из ВыборкаДетальныеЗаписи.Ссылка.Скидки Цикл
			НоменклатураДляСкидок = НоменклатураДляСкидок(ВыборкаСкидки.Номенклатура);
			СтруктураСкидки = Новый Структура("УИД,Код,Наименование,ПометкаУдаления, Скидка",
			Строка(НоменклатураДляСкидок.УникальныйИдентификатор()),  //HELP-4327
			НоменклатураДляСкидок.Код,
			НоменклатураДляСкидок.Наименование,
			НоменклатураДляСкидок.ПометкаУдаления,
			ВыборкаСкидки.Скидка);//HELP-4327
			МассивСкидок.Добавить(СтруктураСкидки);
		КонецЦикла;
		ВыборкаСкидки.Сбросить(); 
		//Данилова Е.В. 16.04.2025 HELP-4327
		
		СтруктураКонтрагента.Вставить("Скидки",МассивСкидок);	
		
		МассивИзмененных.Добавить(СтруктураКонтрагента);
	КонецЦикла;
	Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(МассивИзмененных), Новый СжатиеДанных(9)));
	Возврат Ответ;
	
КонецФункции

Функция НоменклатураДляСкидок(Номенклатура) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Номенклатура.Ссылка
	|		КОГДА Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Номенклатура.Родитель.Ссылка
	|		КОГДА Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Номенклатура.Родитель.Родитель.Ссылка
	|		КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Номенклатура.Родитель.Родитель.Родитель.Ссылка
	|		КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Ссылка
	|		КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|		ИНАЧЕ ""Не найден""
	|	КОНЕЦ КАК НоменклатураДляСкидок
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	
	Возврат ВыборкаДетальныеЗаписи.НоменклатураДляСкидок;
	
КонецФункции

Функция setCounterparty(Параметр1)
	МассивЗаписанных = Десериализовать(Десериализовать(Параметр1).Получить());
	Узел = ПланыОбмена.ОбменМерч.НайтиПоНаименованию("Мерч",Истина);
	Для каждого ЭлементМассива Из МассивЗаписанных Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Справочники.Контрагенты.НайтиПоРеквизиту("КодВторичногоКонтрагентаДляB2B",ЭлементМассива));
	КонецЦикла;
	Возврат Истина;
КонецФункции
// }Кузнецов Сергей Владимирович +++ [07.11.2023]
